ErichStyger/mcuoneclipse/Examples/MCUXpresso/i.MX RT1050_EVK/MIMXRT1052_LCD/board/pin_mux.h
/* GPIO_B1_01 (coord B11), LCDIF_D13 */
#define BOARD_INITPINS_LCDIF_D13_PERIPHERAL                                LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_D13_SIGNAL                               lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITPINS_LCDIF_D13_CHANNEL                                     13U   /*!< LCDIF lcdif_data channel: 13 */
#define BOARD_INITPINS_LCDIF_D13_PIN_NAME                             GPIO_B1_01   /*!< Pin name */
#define BOARD_INITPINS_LCDIF_D13_LABEL                               "LCDIF_D13"   /*!< Label */
#define BOARD_INITPINS_LCDIF_D13_NAME                                "LCDIF_D13"   /*!< Identifier name */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
#define BOARD_INITPINS_LCDIF_D14_PERIPHERAL                                LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_D14_SIGNAL                               lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITPINS_LCDIF_D14_CHANNEL                                     14U   /*!< LCDIF lcdif_data channel: 14 */
#define BOARD_INITPINS_LCDIF_D14_PIN_NAME                             GPIO_B1_02   /*!< Pin name */
#define BOARD_INITPINS_LCDIF_D14_LABEL                               "LCDIF_D14"   /*!< Label */
#define BOARD_INITPINS_LCDIF_D14_NAME                                "LCDIF_D14"   /*!< Identifier name */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
#define BOARD_INITPINS_LCDIF_D15_PERIPHERAL                                LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_D15_SIGNAL                               lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITPINS_LCDIF_D15_CHANNEL                                     15U   /*!< LCDIF lcdif_data channel: 15 */
#define BOARD_INITPINS_LCDIF_D15_PIN_NAME                             GPIO_B1_03   /*!< Pin name */
#define BOARD_INITPINS_LCDIF_D15_LABEL                               "LCDIF_D15"   /*!< Label */
#define BOARD_INITPINS_LCDIF_D15_NAME                                "LCDIF_D15"   /*!< Identifier name */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
#define BOARD_INITPINS_LCDIF_ENABLE_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_ENABLE_SIGNAL                          lcdif_enable   /*!< LCDIF signal: lcdif_enable */
#define BOARD_INITPINS_LCDIF_ENABLE_PIN_NAME                          GPIO_B0_01   /*!< Pin name */
#define BOARD_INITPINS_LCDIF_ENABLE_LABEL                         "LCDIF_ENABLE"   /*!< Label */
#define BOARD_INITPINS_LCDIF_ENABLE_NAME                          "LCDIF_ENABLE"   /*!< Identifier name */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
#define BOARD_INITPINS_LCDIF_HSYNC_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_HSYNC_SIGNAL                            lcdif_hsync   /*!< LCDIF signal: lcdif_hsync */
#define BOARD_INITPINS_LCDIF_HSYNC_PIN_NAME                           GPIO_B0_02   /*!< Pin name */
#define BOARD_INITPINS_LCDIF_HSYNC_LABEL                           "LCDIF_HSYNC"   /*!< Label */
#define BOARD_INITPINS_LCDIF_HSYNC_NAME                            "LCDIF_HSYNC"   /*!< Identifier name */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
#define BOARD_INITPINS_LCDIF_VSYNC_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_VSYNC_SIGNAL                            lcdif_vsync   /*!< LCDIF signal: lcdif_vsync */
#define BOARD_INITPINS_LCDIF_VSYNC_PIN_NAME                           GPIO_B0_03   /*!< Pin name */
#define BOARD_INITPINS_LCDIF_VSYNC_LABEL                           "LCDIF_VSYNC"   /*!< Label */
#define BOARD_INITPINS_LCDIF_VSYNC_NAME                            "LCDIF_VSYNC"   /*!< Identifier name */

/* GPIO_B1_15 (coord B14), USB_HOST_PWR/BACKLIGHT_CTL */
#define BOARD_INITPINS_BACKLIGHT_CTL_GPIO                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_BACKLIGHT_CTL_PORT                                  GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_BACKLIGHT_CTL_GPIO_PIN                                31U   /*!< GPIO2 pin index: 31 */
#define BOARD_INITPINS_BACKLIGHT_CTL_PIN_NAME                         GPIO_B1_15   /*!< Pin name */
#define BOARD_INITPINS_BACKLIGHT_CTL_LABEL          "USB_HOST_PWR/BACKLIGHT_CTL"   /*!< Label */
#define BOARD_INITPINS_BACKLIGHT_CTL_NAME                        "BACKLIGHT_CTL"   /*!< Identifier name */

/* GPIO_AD_B0_09 (coord F14), JTAG_TDI/J21[5]/ENET_RST/J22[5] */
#define BOARD_INITPINS_LED_GPIO                                            GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_LED_PORT                                            GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_LED_GPIO_PIN                                           9U   /*!< GPIO1 pin index: 9 */
#define BOARD_INITPINS_LED_PIN_NAME                                GPIO_AD_B0_09   /*!< Pin name */
#define BOARD_INITPINS_LED_LABEL               "JTAG_TDI/J21[5]/ENET_RST/J22[5]"   /*!< Label */
#define BOARD_INITPINS_LED_NAME                                            "LED"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_EMC_09 (coord C2), SEMC_A0 */
#define BOARD_INITSEMCPINS_SEMC_A0_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A0_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A0_CHANNEL                                    0U   /*!< SEMC ADDR channel: 00 */
#define BOARD_INITSEMCPINS_SEMC_A0_PIN_NAME                          GPIO_EMC_09   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A0_LABEL                               "SEMC_A0"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A0_NAME                                "SEMC_A0"   /*!< Identifier name */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
#define BOARD_INITSEMCPINS_SEMC_A1_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A1_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A1_CHANNEL                                    1U   /*!< SEMC ADDR channel: 01 */
#define BOARD_INITSEMCPINS_SEMC_A1_PIN_NAME                          GPIO_EMC_10   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A1_LABEL                               "SEMC_A1"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A1_NAME                                "SEMC_A1"   /*!< Identifier name */

/* GPIO_EMC_11 (coord G3), SEMC_A2 */
#define BOARD_INITSEMCPINS_SEMC_A2_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A2_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A2_CHANNEL                                    2U   /*!< SEMC ADDR channel: 02 */
#define BOARD_INITSEMCPINS_SEMC_A2_PIN_NAME                          GPIO_EMC_11   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A2_LABEL                               "SEMC_A2"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A2_NAME                                "SEMC_A2"   /*!< Identifier name */

/* GPIO_EMC_12 (coord H1), SEMC_A3 */
#define BOARD_INITSEMCPINS_SEMC_A3_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A3_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A3_CHANNEL                                    3U   /*!< SEMC ADDR channel: 03 */
#define BOARD_INITSEMCPINS_SEMC_A3_PIN_NAME                          GPIO_EMC_12   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A3_LABEL                               "SEMC_A3"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A3_NAME                                "SEMC_A3"   /*!< Identifier name */

/* GPIO_EMC_13 (coord A6), SEMC_A4 */
#define BOARD_INITSEMCPINS_SEMC_A4_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A4_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A4_CHANNEL                                    4U   /*!< SEMC ADDR channel: 04 */
#define BOARD_INITSEMCPINS_SEMC_A4_PIN_NAME                          GPIO_EMC_13   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A4_LABEL                               "SEMC_A4"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A4_NAME                                "SEMC_A4"   /*!< Identifier name */

/* GPIO_EMC_14 (coord B6), SEMC_A5 */
#define BOARD_INITSEMCPINS_SEMC_A5_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A5_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A5_CHANNEL                                    5U   /*!< SEMC ADDR channel: 05 */
#define BOARD_INITSEMCPINS_SEMC_A5_PIN_NAME                          GPIO_EMC_14   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A5_LABEL                               "SEMC_A5"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A5_NAME                                "SEMC_A5"   /*!< Identifier name */

