ErichStyger/mcuoneclipse/Examples/MCUXpresso/i.MX RT1050_EVK/MIMXRT1052_LCD/board/pin_mux.h
/* GPIO_EMC_15 (coord B1), SEMC_A6 */
#define BOARD_INITSEMCPINS_SEMC_A6_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A6_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A6_CHANNEL                                    6U   /*!< SEMC ADDR channel: 06 */
#define BOARD_INITSEMCPINS_SEMC_A6_PIN_NAME                          GPIO_EMC_15   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A6_LABEL                               "SEMC_A6"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A6_NAME                                "SEMC_A6"   /*!< Identifier name */

/* GPIO_EMC_16 (coord A5), SEMC_A7 */
#define BOARD_INITSEMCPINS_SEMC_A7_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A7_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A7_CHANNEL                                    7U   /*!< SEMC ADDR channel: 07 */
#define BOARD_INITSEMCPINS_SEMC_A7_PIN_NAME                          GPIO_EMC_16   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A7_LABEL                               "SEMC_A7"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A7_NAME                                "SEMC_A7"   /*!< Identifier name */

/* GPIO_EMC_17 (coord A4), SEMC_A8 */
#define BOARD_INITSEMCPINS_SEMC_A8_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A8_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A8_CHANNEL                                    8U   /*!< SEMC ADDR channel: 08 */
#define BOARD_INITSEMCPINS_SEMC_A8_PIN_NAME                          GPIO_EMC_17   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A8_LABEL                               "SEMC_A8"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A8_NAME                                "SEMC_A8"   /*!< Identifier name */

/* GPIO_EMC_18 (coord B2), SEMC_A9 */
#define BOARD_INITSEMCPINS_SEMC_A9_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A9_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A9_CHANNEL                                    9U   /*!< SEMC ADDR channel: 09 */
#define BOARD_INITSEMCPINS_SEMC_A9_PIN_NAME                          GPIO_EMC_18   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A9_LABEL                               "SEMC_A9"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A9_NAME                                "SEMC_A9"   /*!< Identifier name */

/* GPIO_EMC_23 (coord G2), SEMC_A10 */
#define BOARD_INITSEMCPINS_SEMC_A10_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A10_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A10_CHANNEL                                  10U   /*!< SEMC ADDR channel: 10 */
#define BOARD_INITSEMCPINS_SEMC_A10_PIN_NAME                         GPIO_EMC_23   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A10_LABEL                             "SEMC_A10"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A10_NAME                              "SEMC_A10"   /*!< Identifier name */

/* GPIO_EMC_19 (coord B4), SEMC_A11 */
#define BOARD_INITSEMCPINS_SEMC_A11_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A11_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A11_CHANNEL                                  11U   /*!< SEMC ADDR channel: 11 */
#define BOARD_INITSEMCPINS_SEMC_A11_PIN_NAME                         GPIO_EMC_19   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A11_LABEL                             "SEMC_A11"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A11_NAME                              "SEMC_A11"   /*!< Identifier name */

/* GPIO_EMC_20 (coord A3), SEMC_A12 */
#define BOARD_INITSEMCPINS_SEMC_A12_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A12_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A12_CHANNEL                                  12U   /*!< SEMC ADDR channel: 12 */
#define BOARD_INITSEMCPINS_SEMC_A12_PIN_NAME                         GPIO_EMC_20   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_A12_LABEL                             "SEMC_A12"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_A12_NAME                              "SEMC_A12"   /*!< Identifier name */

/* GPIO_EMC_21 (coord C1), SEMC_BA0 */
#define BOARD_INITSEMCPINS_SEMC_BA0_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_BA0_SIGNAL                                    BA   /*!< SEMC signal: BA */
#define BOARD_INITSEMCPINS_SEMC_BA0_CHANNEL                                   0U   /*!< SEMC BA channel: 0 */
#define BOARD_INITSEMCPINS_SEMC_BA0_PIN_NAME                         GPIO_EMC_21   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_BA0_LABEL                             "SEMC_BA0"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_BA0_NAME                              "SEMC_BA0"   /*!< Identifier name */

/* GPIO_EMC_22 (coord F1), SEMC_BA1 */
#define BOARD_INITSEMCPINS_SEMC_BA1_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_BA1_SIGNAL                                    BA   /*!< SEMC signal: BA */
#define BOARD_INITSEMCPINS_SEMC_BA1_CHANNEL                                   1U   /*!< SEMC BA channel: 1 */
#define BOARD_INITSEMCPINS_SEMC_BA1_PIN_NAME                         GPIO_EMC_22   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_BA1_LABEL                             "SEMC_BA1"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_BA1_NAME                              "SEMC_BA1"   /*!< Identifier name */

