ErichStyger/mcuoneclipse/Examples/MCUXpresso/i.MX RT1050_EVK/MIMXRT1052_LCD/board/pin_mux.h
/* GPIO_EMC_24 (coord D3), SEMC_CAS */
#define BOARD_INITSEMCPINS_SEMC_CAS_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_CAS_SIGNAL                              semc_cas   /*!< SEMC signal: semc_cas */
#define BOARD_INITSEMCPINS_SEMC_CAS_PIN_NAME                         GPIO_EMC_24   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_CAS_LABEL                             "SEMC_CAS"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_CAS_NAME                              "SEMC_CAS"   /*!< Identifier name */

/* GPIO_EMC_27 (coord A2), SEMC_CKE */
#define BOARD_INITSEMCPINS_SEMC_CKE_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_CKE_SIGNAL                              semc_cke   /*!< SEMC signal: semc_cke */
#define BOARD_INITSEMCPINS_SEMC_CKE_PIN_NAME                         GPIO_EMC_27   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_CKE_LABEL                             "SEMC_CKE"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_CKE_NAME                              "SEMC_CKE"   /*!< Identifier name */

/* GPIO_EMC_26 (coord B3), SEMC_CLK */
#define BOARD_INITSEMCPINS_SEMC_CLK_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_CLK_SIGNAL                              semc_clk   /*!< SEMC signal: semc_clk */
#define BOARD_INITSEMCPINS_SEMC_CLK_PIN_NAME                         GPIO_EMC_26   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_CLK_LABEL                             "SEMC_CLK"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_CLK_NAME                              "SEMC_CLK"   /*!< Identifier name */

/* GPIO_EMC_29 (coord E1), SEMC_CS0 */
#define BOARD_INITSEMCPINS_SEMC_CS0_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_CS0_SIGNAL                                    CS   /*!< SEMC signal: CS */
#define BOARD_INITSEMCPINS_SEMC_CS0_CHANNEL                                   0U   /*!< SEMC CS channel: 0 */
#define BOARD_INITSEMCPINS_SEMC_CS0_PIN_NAME                         GPIO_EMC_29   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_CS0_LABEL                             "SEMC_CS0"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_CS0_NAME                              "SEMC_CS0"   /*!< Identifier name */

/* GPIO_EMC_00 (coord E3), SEMC_D0 */
#define BOARD_INITSEMCPINS_SEMC_D0_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D0_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D0_CHANNEL                                    0U   /*!< SEMC DATA channel: 00 */
#define BOARD_INITSEMCPINS_SEMC_D0_PIN_NAME                          GPIO_EMC_00   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D0_LABEL                               "SEMC_D0"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D0_NAME                                "SEMC_D0"   /*!< Identifier name */

/* GPIO_EMC_01 (coord F3), SEMC_D1 */
#define BOARD_INITSEMCPINS_SEMC_D1_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D1_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D1_CHANNEL                                    1U   /*!< SEMC DATA channel: 01 */
#define BOARD_INITSEMCPINS_SEMC_D1_PIN_NAME                          GPIO_EMC_01   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D1_LABEL                               "SEMC_D1"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D1_NAME                                "SEMC_D1"   /*!< Identifier name */

/* GPIO_EMC_02 (coord F4), SEMC_D2 */
#define BOARD_INITSEMCPINS_SEMC_D2_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D2_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D2_CHANNEL                                    2U   /*!< SEMC DATA channel: 02 */
#define BOARD_INITSEMCPINS_SEMC_D2_PIN_NAME                          GPIO_EMC_02   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D2_LABEL                               "SEMC_D2"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D2_NAME                                "SEMC_D2"   /*!< Identifier name */

/* GPIO_EMC_03 (coord G4), SEMC_D3 */
#define BOARD_INITSEMCPINS_SEMC_D3_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D3_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D3_CHANNEL                                    3U   /*!< SEMC DATA channel: 03 */
#define BOARD_INITSEMCPINS_SEMC_D3_PIN_NAME                          GPIO_EMC_03   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D3_LABEL                               "SEMC_D3"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D3_NAME                                "SEMC_D3"   /*!< Identifier name */

/* GPIO_EMC_04 (coord F2), SEMC_D4 */
#define BOARD_INITSEMCPINS_SEMC_D4_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D4_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D4_CHANNEL                                    4U   /*!< SEMC DATA channel: 04 */
#define BOARD_INITSEMCPINS_SEMC_D4_PIN_NAME                          GPIO_EMC_04   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D4_LABEL                               "SEMC_D4"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D4_NAME                                "SEMC_D4"   /*!< Identifier name */

/* GPIO_EMC_05 (coord G5), SEMC_D5 */
#define BOARD_INITSEMCPINS_SEMC_D5_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D5_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D5_CHANNEL                                    5U   /*!< SEMC DATA channel: 05 */
#define BOARD_INITSEMCPINS_SEMC_D5_PIN_NAME                          GPIO_EMC_05   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D5_LABEL                               "SEMC_D5"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D5_NAME                                "SEMC_D5"   /*!< Identifier name */

/* GPIO_EMC_06 (coord H5), SEMC_D6 */
#define BOARD_INITSEMCPINS_SEMC_D6_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D6_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D6_CHANNEL                                    6U   /*!< SEMC DATA channel: 06 */
#define BOARD_INITSEMCPINS_SEMC_D6_PIN_NAME                          GPIO_EMC_06   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D6_LABEL                               "SEMC_D6"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D6_NAME                                "SEMC_D6"   /*!< Identifier name */

/* GPIO_EMC_07 (coord H4), SEMC_D7 */
#define BOARD_INITSEMCPINS_SEMC_D7_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D7_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D7_CHANNEL                                    7U   /*!< SEMC DATA channel: 07 */
#define BOARD_INITSEMCPINS_SEMC_D7_PIN_NAME                          GPIO_EMC_07   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D7_LABEL                               "SEMC_D7"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D7_NAME                                "SEMC_D7"   /*!< Identifier name */

/* GPIO_EMC_30 (coord C6), SEMC_D8 */
#define BOARD_INITSEMCPINS_SEMC_D8_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D8_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D8_CHANNEL                                    8U   /*!< SEMC DATA channel: 08 */
#define BOARD_INITSEMCPINS_SEMC_D8_PIN_NAME                          GPIO_EMC_30   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D8_LABEL                               "SEMC_D8"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D8_NAME                                "SEMC_D8"   /*!< Identifier name */

/* GPIO_EMC_31 (coord C5), SEMC_D9 */
#define BOARD_INITSEMCPINS_SEMC_D9_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D9_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D9_CHANNEL                                    9U   /*!< SEMC DATA channel: 09 */
#define BOARD_INITSEMCPINS_SEMC_D9_PIN_NAME                          GPIO_EMC_31   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D9_LABEL                               "SEMC_D9"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D9_NAME                                "SEMC_D9"   /*!< Identifier name */

/* GPIO_EMC_32 (coord D5), SEMC_D10 */
#define BOARD_INITSEMCPINS_SEMC_D10_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D10_SIGNAL                                  DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D10_CHANNEL                                  10U   /*!< SEMC DATA channel: 10 */
#define BOARD_INITSEMCPINS_SEMC_D10_PIN_NAME                         GPIO_EMC_32   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D10_LABEL                             "SEMC_D10"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D10_NAME                              "SEMC_D10"   /*!< Identifier name */

/* GPIO_EMC_33 (coord C4), SEMC_D11 */
#define BOARD_INITSEMCPINS_SEMC_D11_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D11_SIGNAL                                  DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D11_CHANNEL                                  11U   /*!< SEMC DATA channel: 11 */
#define BOARD_INITSEMCPINS_SEMC_D11_PIN_NAME                         GPIO_EMC_33   /*!< Pin name */
#define BOARD_INITSEMCPINS_SEMC_D11_LABEL                             "SEMC_D11"   /*!< Label */
#define BOARD_INITSEMCPINS_SEMC_D11_NAME                              "SEMC_D11"   /*!< Identifier name */

